tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1779_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16F1779_H_
#define _PIC16F1779_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define STATUS_DC                     6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define RA6                           42
#define RA7                           43
#define PORTB                         44
#define RB0                           45
#define RB1                           46
#define RB2                           47
#define RB3                           48
#define RB4                           49
#define RB5                           50
#define RB6                           51
#define RB7                           52
#define PORTC                         53
#define RC0                           54
#define RC1                           55
#define RC2                           56
#define RC3                           57
#define RC4                           58
#define RC5                           59
#define RC6                           60
#define RC7                           61
#define PORTD                         62
#define RD0                           63
#define RD1                           64
#define RD2                           65
#define RD3                           66
#define RD4                           67
#define RD5                           68
#define RD6                           69
#define RD7                           70
#define PORTE                         71
#define RE0                           72
#define RE1                           73
#define RE2                           74
#define RE3                           75
#define PIR1                          76
#define TMR1IF                        77
#define TMR2IF                        78
#define CCP1IF                        79
#define CCPIF                         80
#define SSP1IF                        81
#define TXIF                          82
#define RCIF                          83
#define ADIF                          84
#define TMR1GIF                       85
#define PIR2                          86
#define CCP2IF                        87
#define C3IF                          88
#define C4IF                          89
#define BCL1IF                        90
#define COG1IF                        91
#define C1IF                          92
#define C2IF                          93
#define OSFIF                         94
#define PIR3                          95
#define CLC1IF                        96
#define CLC2IF                        97
#define CLC3IF                        98
#define CLC4IF                        99
#define ZCDIF                         100
#define COG2IF                        101
#define PIR4                          102
#define TMR4IF                        103
#define TMR6IF                        104
#define TMR3IF                        105
#define TMR3GIF                       106
#define TMR5IF                        107
#define TMR5GIF                       108
#define TMR8IF                        109
#define PIR5                          110
#define C5IF                          111
#define C6IF                          112
#define C7IF                          113
#define C8IF                          114
#define COG3IF                        115
#define COG4IF                        116
#define CCP7IF                        117
#define CCP8IF                        118
#define PIR6                          119
#define PWM5IF                        120
#define PWM6IF                        121
#define PWM11IF                       122
#define PWM12IF                       123
#define TMR0                          124
#define TMR1L                         125
#define TMR1L_TMR                     126
#define TMR1H                         127
#define TMR1H_TMR                     128
#define T1CON                         129
#define T1CON_TMRON                   130
#define TMR1ON                        131
#define T1CON_ON                      132
#define T1ON                          133
#define T1CON_nSYNC                   134
#define T1CON_SYNC                    135
#define nT1SYNC                       136
#define T1OSCEN                       137
#define T1CON_SOSCEN                  138
#define T1CON_OSCEN                   139
#define T1CKPS0                       140
#define T1CON_CKPS0                   141
#define T1CON_CKPS                    142
#define T1CON_CKPS1                   143
#define T1CKPS1                       144
#define T1CS0                         145
#define T1CON_CS0                     146
#define TMR1CS0                       147
#define T1CON_CS                      148
#define T1CS1                         149
#define T1CON_CS1                     150
#define TMR1CS1                       151
#define T1GCON                        152
#define T1GCON_GSS0                   153
#define T1GCON_GSS                    154
#define T1GSS0                        155
#define T1GCON_GSS1                   156
#define T1GSS1                        157
#define T1GCON_GVAL                   158
#define T1GVAL                        159
#define T1GGO_nDONE                   160
#define T1GCON_GGO_nDONE              161
#define T1GCON_GSPM                   162
#define T1GSPM                        163
#define T1GTM                         164
#define T1GCON_GTM                    165
#define T1GPOL                        166
#define T1GCON_GPOL                   167
#define T1GCON_GE                     168
#define TMR1GE                        169
#define T1GE                          170
#define TMR3L                         171
#define TMR3L_TMR                     172
#define TMR3H                         173
#define TMR3H_TMR                     174
#define T3CON                         175
#define T3CON_TMRON                   176
#define TMR3ON                        177
#define T3CON_ON                      178
#define T3ON                          179
#define nT3SYNC                       180
#define T3CON_nSYNC                   181
#define T3CON_SYNC                    182
#define T3CON_SOSCEN                  183
#define T3CON_OSCEN                   184
#define T3OSCEN                       185
#define T3CON_CKPS0                   186
#define T3CKPS0                       187
#define T3CON_CKPS                    188
#define T3CON_CKPS1                   189
#define T3CKPS1                       190
#define TMR3CS0                       191
#define T3CON_CS0                     192
#define T3CS0                         193
#define T3CON_CS                      194
#define TMR3CS1                       195
#define T3CON_CS1                     196
#define T3CS1                         197
#define T3GCON                        198
#define T3GCON_GSS0                   199
#define T3GSS0                        200
#define T3GCON_GSS                    201
#define T3GCON_GSS1                   202
#define T3GSS1                        203
#define T3GCON_GVAL                   204
#define T3GVAL                        205
#define T3GCON_GGO_nDONE              206
#define T3GGO_nDONE                   207
#define T3GSPM                        208
#define T3GCON_GSPM                   209
#define T3GCON_GTM                    210
#define T3GTM                         211
#define T3GPOL                        212
#define T3GCON_GPOL                   213
#define TMR3GE                        214
#define T3GCON_GE                     215
#define T3GE                          216
#define TRISA                         217
#define TRISA0                        218
#define TRISA1                        219
#define TRISA2                        220
#define TRISA3                        221
#define TRISA4                        222
#define TRISA5                        223
#define TRISA6                        224
#define TRISA7                        225
#define TRISB                         226
#define TRISB0                        227
#define TRISB1                        228
#define TRISB2                        229
#define TRISB3                        230
#define TRISB4                        231
#define TRISB5                        232
#define TRISB6                        233
#define TRISB7                        234
#define TRISC                         235
#define TRISC0                        236
#define TRISC1                        237
#define TRISC2                        238
#define TRISC3                        239
#define TRISC4                        240
#define TRISC5                        241
#define TRISC6                        242
#define TRISC7                        243
#define TRISD                         244
#define TRISD0                        245
#define TRISD1                        246
#define TRISD2                        247
#define TRISD3                        248
#define TRISD4                        249
#define TRISD5                        250
#define TRISD6                        251
#define TRISD7                        252
#define TRISE                         253
#define TRISE0                        254
#define TRISE1                        255
#define TRISE2                        256
#define TRISE3                        257
#define PIE1                          258
#define TMR1IE                        259
#define TMR2IE                        260
#define CCP1IE                        261
#define CCPIE                         262
#define SSP1IE                        263
#define TXIE                          264
#define RCIE                          265
#define ADIE                          266
#define TMR1GIE                       267
#define PIE2                          268
#define CCP2IE                        269
#define C3IE                          270
#define C4IE                          271
#define BCL1IE                        272
#define COGIE                         273
#define C1IE                          274
#define C2IE                          275
#define OSFIE                         276
#define PIE3                          277
#define CLC1IE                        278
#define CLC2IE                        279
#define CLC3IE                        280
#define CLC4IE                        281
#define ZCDIE                         282
#define COG2IE                        283
#define PIE4                          284
#define TMR4IE                        285
#define TMR6IE                        286
#define TMR3IE                        287
#define TMR3GIE                       288
#define TMR5IE                        289
#define TMR5GIE                       290
#define TMR8IE                        291
#define PIE5                          292
#define C5IE                          293
#define C6IE                          294
#define C7IE                          295
#define C8IE                          296
#define COG3IE                        297
#define COG4IE                        298
#define CCP7IE                        299
#define CCP8IE                        300
#define PIE6                          301
#define PWM5IE                        302
#define PWM6IE                        303
#define PWM11IE                       304
#define PWM12IE                       305
#define OPTION_REG                    306
#define OPTION_REG_PS                 307
#define OPTION_REG_PS0                308
#define OPTION_REG_PS1                309
#define OPTION_REG_PS2                310
#define PSA                           311
#define T0SE                          312
#define TMR0SE                        313
#define T0CS                          314
#define TMR0CS                        315
#define INTEDG                        316
#define nWPUEN                        317
#define PCON                          318
#define nBOR                          319
#define nPOR                          320
#define nRI                           321
#define nRMCLR                        322
#define nRWDT                         323
#define STKUNF                        324
#define STKOVF                        325
#define WDTCON                        326
#define SWDTEN                        327
#define WDTPS                         328
#define WDTPS0                        329
#define WDTPS1                        330
#define WDTPS2                        331
#define WDTPS3                        332
#define WDTPS4                        333
#define OSCTUNE                       334
#define TUN0                          335
#define TUN                           336
#define TUN1                          337
#define TUN2                          338
#define TUN3                          339
#define TUN4                          340
#define TUN5                          341
#define OSCCON                        342
#define SCS0                          343
#define SCS                           344
#define SCS1                          345
#define IRCF                          346
#define IRCF0                         347
#define IRCF1                         348
#define IRCF2                         349
#define IRCF3                         350
#define SPLLEN                        351
#define OSCSTAT                       352
#define HFIOFS                        353
#define LFIOFR                        354
#define MFIOFR                        355
#define HFIOFL                        356
#define HFIOFR                        357
#define OSTS                          358
#define PLLR                          359
#define SOSCR                         360
#define BORCON                        361
#define BORRDY                        362
#define BORFS                         363
#define SBOREN                        364
#define FVRCON                        365
#define ADFVR                         366
#define CDAFVR                        367
#define TSRNG                         368
#define TSEN                          369
#define FVRRDY                        370
#define FVREN                         371
#define ZCD1CON                       372
#define ZCD1INTN                      373
#define ZCD1INTP                      374
#define ZCD1POL                       375
#define ZCD1OUT                       376
#define ZCD1EN                        377
#define LATA                          378
#define LATA0                         379
#define LATA1                         380
#define LATA2                         381
#define LATA3                         382
#define LATA4                         383
#define LATA5                         384
#define LATA6                         385
#define LATA7                         386
#define LATB                          387
#define LATB0                         388
#define LATB1                         389
#define LATB2                         390
#define LATB3                         391
#define LATB4                         392
#define LATB5                         393
#define LATB6                         394
#define LATB7                         395
#define LATC                          396
#define LATC0                         397
#define LATC1                         398
#define LATC2                         399
#define LATC3                         400
#define LATC4                         401
#define LATC5                         402
#define LATC6                         403
#define LATC7                         404
#define LATD                          405
#define LATD0                         406
#define LATD1                         407
#define LATD2                         408
#define LATD3                         409
#define LATD4                         410
#define LATD5                         411
#define LATD6                         412
#define LATD7                         413
#define LATE                          414
#define LATE0                         415
#define LATE1                         416
#define LATE2                         417
#define CMOUT                         418
#define MC1OUT                        419
#define MC2OUT                        420
#define MC3OUT                        421
#define MC4OUT                        422
#define MC5OUT                        423
#define MC6OUT                        424
#define MC7OUT                        425
#define MC80UT                        426
#define CM1CON0                       427
#define C1SYNC                        428
#define CM1CON0_SYNC                  429
#define CM1CON0_HYS                   430
#define C1HYS                         431
#define C1SP                          432
#define CM1CON0_ZLF                   433
#define C1ZLF                         434
#define CM1CON0_POL                   435
#define C1POL                         436
#define C1OUT                         437
#define CM1CON0_OUT                   438
#define CM1CON0_ON                    439
#define C1ON                          440
#define CM1CON1                       441
#define C1INTN                        442
#define CM1CON1_INTN                  443
#define CM1CON1_INTP                  444
#define C1INTP                        445
#define CM1NSEL                       446
#define C1NCH0                        447
#define CM1NSEL_NCH                   448
#define C1NCH                         449
#define C1NCH1                        450
#define C1NCH2                        451
#define C1NCH3                        452
#define CM1PSEL                       453
#define CM1PSEL_PCH                   454
#define C1PCH                         455
#define C1PCH0                        456
#define CM1PSEL_PCH0                  457
#define C1PCH1                        458
#define CM1PSEL_PCH1                  459
#define C1PCH2                        460
#define CM1PSEL_PCH2                  461
#define C1PCH3                        462
#define CM1PSEL_PCH3                  463
#define CM2CON0                       464
#define CM2CON0_SYNC                  465
#define C2SYNC                        466
#define C2HYS                         467
#define CM2CON0_HYS                   468
#define C2SP                          469
#define C2ZLF                         470
#define CM2CON0_ZLF                   471
#define C2POL                         472
#define CM2CON0_POL                   473
#define C2OUT                         474
#define CM2CON0_OUT                   475
#define CM2CON0_ON                    476
#define C2ON                          477
#define CM2CON1                       478
#define C2INTN                        479
#define CM2CON1_INTN                  480
#define CM2CON1_INTP                  481
#define C2INTP                        482
#define CM2NSEL                       483
#define C2NCH0                        484
#define CM2NSEL_NCH                   485
#define C2NCH                         486
#define C2NCH1                        487
#define C2NCH2                        488
#define C2NCH3                        489
#define CM2PSEL                       490
#define CM2PSEL_PCH                   491
#define C2PCH                         492
#define C2PCH0                        493
#define CM2PSEL_PCH0                  494
#define C2PCH1                        495
#define CM2PSEL_PCH1                  496
#define CM2PSEL_PCH2                  497
#define C2PCH2                        498
#define CM2PSEL_PCH3                  499
#define C2PCH3                        500
#define CM3CON0                       501
#define C3SYNC                        502
#define CM3CON0_SYNC                  503
#define CM3CON0_HYS                   504
#define C3HYS                         505
#define C3SP                          506
#define CM3CON0_ZLF                   507
#define C3ZLF                         508
#define CM3CON0_POL                   509
#define C3POL                         510
#define C3OUT                         511
#define CM3CON0_OUT                   512
#define CM3CON0_ON                    513
#define C3ON                          514
#define CM3CON1                       515
#define CM3CON1_INTN                  516
#define C3INTN                        517
#define CM3CON1_INTP                  518
#define C3INTP                        519
#define CM3NSEL                       520
#define CM3NSEL_NCH                   521
