tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1779_tdd.h
#define C3NCH                         522
#define C3NCH0                        523
#define C3NCH1                        524
#define C3NCH2                        525
#define C3NCH3                        526
#define CM3PSEL                       527
#define CM3PSEL_PCH0                  528
#define C3PCH                         529
#define CM3PSEL_PCH                   530
#define C3PCH0                        531
#define CM3PSEL_PCH1                  532
#define C3PCH1                        533
#define CM3PSEL_PCH2                  534
#define C3PCH2                        535
#define CM3PSEL_PCH3                  536
#define C3PCH3                        537
#define ANSELA                        538
#define ANSA0                         539
#define ANSA1                         540
#define ANSA2                         541
#define ANSA3                         542
#define ANSA4                         543
#define ANSA5                         544
#define ANSELB                        545
#define ANSB0                         546
#define ANSB1                         547
#define ANSB2                         548
#define ANSB3                         549
#define ANSB4                         550
#define ANSB5                         551
#define ANSELC                        552
#define ANSC2                         553
#define ANSC3                         554
#define ANSC4                         555
#define ANSC5                         556
#define ANSC6                         557
#define ANSC7                         558
#define ANSELD                        559
#define ANSD0                         560
#define ANSD1                         561
#define ANSD2                         562
#define ANSD3                         563
#define ANSD4                         564
#define ANSD5                         565
#define ANSD6                         566
#define ANSD7                         567
#define ANSELE                        568
#define ANSE0                         569
#define ANSE1                         570
#define ANSE2                         571
#define PMADRL                        572
#define PMADRH                        573
#define PMDATL                        574
#define PMDATH                        575
#define PMCON1                        576
#define RD                            577
#define WR                            578
#define WREN                          579
#define WRERR                         580
#define FREE                          581
#define LWLO                          582
#define CFGS                          583
#define PMCON2                        584
#define VREGCON                       585
#define VREGPM                        586
#define RC1REG                        587
#define TX1REG                        588
#define SP1BRGL                       589
#define SP1BRGH                       590
#define RC1STA                        591
#define RX9D                          592
#define OERR                          593
#define FERR                          594
#define ADDEN                         595
#define CREN                          596
#define SREN                          597
#define RX9                           598
#define SPEN                          599
#define TX1STA                        600
#define TX9D                          601
#define TRMT                          602
#define BRGH                          603
#define SENDB                         604
#define TX1STA_SYNC                   605
#define TXEN                          606
#define TX9                           607
#define CSRC                          608
#define BAUD1CON                      609
#define ABDEN                         610
#define WUE                           611
#define BRG16                         612
#define SCKP                          613
#define RCIDL                         614
#define ABDOVF                        615
#define WPUA                          616
#define WPUA0                         617
#define WPUA1                         618
#define WPUA2                         619
#define WPUA3                         620
#define WPUA4                         621
#define WPUA5                         622
#define WPUA6                         623
#define WPUA7                         624
#define WPUB                          625
#define WPUB0                         626
#define WPUB1                         627
#define WPUB2                         628
#define WPUB3                         629
#define WPUB4                         630
#define WPUB5                         631
#define WPUB6                         632
#define WPUB7                         633
#define WPUC                          634
#define WPUC0                         635
#define WPUC1                         636
#define WPUC2                         637
#define WPUC3                         638
#define WPUC4                         639
#define WPUC5                         640
#define WPUC6                         641
#define WPUC7                         642
#define WPUD                          643
#define WPUD0                         644
#define WPUD1                         645
#define WPUD2                         646
#define WPUD3                         647
#define WPUD4                         648
#define WPUD5                         649
#define WPUD6                         650
#define WPUD7                         651
#define WPUE                          652
#define WPUE0                         653
#define WPUE1                         654
#define WPUE2                         655
#define WPUE3                         656
#define SSP1BUF                       657
#define BUF                           658
#define BUF0                          659
#define SSP1BUF0                      660
#define BUF1                          661
#define SSP1BUF1                      662
#define BUF2                          663
#define SSP1BUF2                      664
#define BUF3                          665
#define SSP1BUF3                      666
#define BUF4                          667
#define SSP1BUF4                      668
#define BUF5                          669
#define SSP1BUF5                      670
#define BUF6                          671
#define SSP1BUF6                      672
#define BUF7                          673
#define SSP1BUF7                      674
#define ADD0                          675
#define ADD                           676
#define SSP1ADD0                      677
#define SSP1ADD                       678
#define ADD1                          679
#define SSP1ADD1                      680
#define ADD2                          681
#define SSP1ADD2                      682
#define ADD3                          683
#define SSP1ADD3                      684
#define ADD4                          685
#define SSP1ADD4                      686
#define ADD5                          687
#define SSP1ADD5                      688
#define ADD6                          689
#define SSP1ADD6                      690
#define ADD7                          691
#define SSP1ADD7                      692
#define SSP1MSK0                      693
#define SSP1MSK                       694
#define MSK0                          695
#define MSK                           696
#define SSP1MSK1                      697
#define MSK1                          698
#define SSP1MSK2                      699
#define MSK2                          700
#define SSP1MSK3                      701
#define MSK3                          702
#define SSP1MSK4                      703
#define MSK4                          704
#define SSP1MSK5                      705
#define MSK5                          706
#define SSP1MSK6                      707
#define MSK6                          708
#define SSP1MSK7                      709
#define MSK7                          710
#define SSP1STAT                      711
#define BF                            712
#define UA                            713
#define R_nW                          714
#define S                             715
#define P                             716
#define D_nA                          717
#define CKE                           718
#define SMP                           719
#define SSP1CON1                      720
#define SSPM0                         721
#define SSPM                          722
#define SSPM1                         723
#define SSPM2                         724
#define SSPM3                         725
#define CKP                           726
#define SSPEN                         727
#define SSPOV                         728
#define WCOL                          729
#define SSP1CON2                      730
#define SEN                           731
#define RSEN                          732
#define PEN                           733
#define RCEN                          734
#define ACKEN                         735
#define ACKDT                         736
#define ACKSTAT                       737
#define GCEN                          738
#define SSP1CON3                      739
#define DHEN                          740
#define AHEN                          741
#define SBCDE                         742
#define SDAHT                         743
#define BOEN                          744
#define SCIE                          745
#define PCIE                          746
#define ACKTIM                        747
#define MD3CON0                       748
#define MD3BIT                        749
#define MD3CON0_BIT                   750
#define MD3CON0_OPOL                  751
#define MD3OPOL                       752
#define MD3CON0_OUT                   753
#define MD3OUT                        754
#define MD3EN                         755
#define MD3CON0_EN                    756
#define MD3CON1                       757
#define MD3CLSYNC                     758
#define MD3CON1_CLSYNC                759
#define MD3CLPOL                      760
#define MD3CON1_CLPOL                 761
#define MD3CON1_CHSYNC                762
#define MD3CHSYNC                     763
#define MD3CON1_CHPOL                 764
#define MD3CHPOL                      765
#define MD3SRC                        766
#define MD3SRC_MS                     767
#define MD3MS0                        768
#define MD3SRC_MS0                    769
#define MD3MS                         770
#define MD3SRC_MS1                    771
#define MD3MS1                        772
#define MD3SRC_MS2                    773
#define MD3MS2                        774
#define MD3SRC_MS3                    775
#define MD3MS3                        776
#define MD3SRC_MS4                    777
#define MD3MS4                        778
#define MD3CARL                       779
#define MD3CARL_CL0                   780
#define MD3CL                         781
#define MD3CARL_CL                    782
#define MD3CL0                        783
#define MD3CL1                        784
#define MD3CARL_CL1                   785
#define MD3CARL_CL2                   786
#define MD3CL2                        787
#define MD3CARL_CL3                   788
#define MD3CL3                        789
#define MD3CARL_CL4                   790
#define MD3CARH                       791
#define MD3CARH_CH                    792
#define MD3CARH_CH0                   793
#define MD3CH                         794
#define MD3CH0                        795
#define MD3CARH_CH1                   796
#define MD3CH1                        797
#define MD3CARH_CH2                   798
#define MD3CH2                        799
#define MD3CARH_CH3                   800
#define MD3CH3                        801
#define MD3CARH_CH4                   802
#define ODCONA                        803
#define ODA0                          804
#define ODA1                          805
#define ODA2                          806
#define ODA3                          807
#define ODA4                          808
#define ODA5                          809
#define ODA6                          810
#define ODA7                          811
#define ODCONB                        812
#define ODB0                          813
#define ODB1                          814
#define ODB2                          815
#define ODB3                          816
#define ODB4                          817
#define ODB5                          818
#define ODB6                          819
#define ODB7                          820
#define ODCONC                        821
#define ODC0                          822
#define ODC1                          823
#define ODC2                          824
#define ODC3                          825
#define ODC4                          826
#define ODC5                          827
#define ODC6                          828
#define ODC7                          829
#define ODCOND                        830
#define ODD0                          831
#define ODD1                          832
#define ODD2                          833
#define ODD3                          834
#define ODD4                          835
#define ODD5                          836
#define ODD6                          837
#define ODD7                          838
#define ODCONE                        839
#define ODE0                          840
#define ODE1                          841
#define ODE2                          842
#define CCPR1L                        843
#define CCPR1L_RL                     844
#define CCPR1H                        845
#define CCPR1H_RH                     846
#define CCP1CON                       847
#define CCP1CON_MODE                  848
#define CCP1MODE0                     849
#define CCP1CON_MODE0                 850
#define CCP1MODE                      851
#define CCP1MODE1                     852
#define CCP1CON_MODE1                 853
#define CCP1MODE2                     854
#define CCP1CON_MODE2                 855
#define CCP1MODE3                     856
#define CCP1CON_MODE3                 857
#define CCP1CON_FMT                   858
#define CCP1FMT                       859
#define CCP1CON_OUT                   860
#define CCP1OUT                       861
#define CCP1EN                        862
#define CCP1CON_EN                    863
#define CCP1CAP                       864
#define CCP1CTS0                      865
#define CCP1CAP_CTS                   866
#define CCP1CAP_CTS0                  867
#define CCP1CTS                       868
#define CCP1CTS1                      869
#define CCP1CAP_CTS1                  870
#define CCP1CTS2                      871
#define CCP1CAP_CTS2                  872
#define CCP1CTS3                      873
#define CCP1CAP_CTS3                  874
#define CCPR2L                        875
#define CCPR2L_RL                     876
#define CCPR2H                        877
#define CCPR2H_RH                     878
#define CCP2CON                       879
#define CCP2MODE                      880
#define CCP2MODE0                     881
#define CCP2CON_MODE0                 882
#define CCP2CON_MODE                  883
#define CCP2MODE1                     884
#define CCP2CON_MODE1                 885
#define CCP2MODE2                     886
#define CCP2CON_MODE2                 887
#define CCP2MODE3                     888
#define CCP2CON_MODE3                 889
#define CCP2FMT                       890
#define CCP2CON_FMT                   891
#define CCP2OUT                       892
#define CCP2CON_OUT                   893
#define CCP2EN                        894
#define CCP2CON_EN                    895
#define CCP2CAP                       896
#define CCP2CAP_CTS                   897
#define CCP2CAP_CTS0                  898
#define CCP2CTS                       899
#define CCP2CTS0                      900
#define CCP2CAP_CTS1                  901
#define CCP2CTS1                      902
#define CCP2CAP_CTS2                  903
#define CCP2CTS2                      904
#define CCP2CAP_CTS3                  905
#define CCP2CTS3                      906
#define CCPR7L                        907
#define CCPR7L_RL                     908
#define CCPR7H                        909
#define CCPR7H_RH                     910
#define CCP7CON                       911
#define CCP7CON_MODE0                 912
#define CCP7CON_MODE                  913
#define CCP7MODE0                     914
#define CCP7MODE                      915
#define CCP7CON_MODE1                 916
#define CCP7MODE1                     917
#define CCP7CON_MODE2                 918
#define CCP7MODE2                     919
#define CCP7CON_MODE3                 920
#define CCP7MODE3                     921
#define CCP7CON_FMT                   922
#define CCP7FMT                       923
#define CCP7CON_OUT                   924
#define CCP7OUT                       925
#define CCP7EN                        926
#define CCP7CON_EN                    927
#define CCP7CAP                       928
#define CCP7CTS                       929
#define CCP7CAP_CTS0                  930
#define CCP7CAP_CTS                   931
#define CCP7CTS0                      932
#define CCP7CTS1                      933
#define CCP7CAP_CTS1                  934
#define CCP7CTS2                      935
#define CCP7CAP_CTS2                  936
#define CCP7CAP_CTS3                  937
#define CCP7CTS3                      938
#define CCPTMRS1                      939
#define C1TSEL0                       940
#define C1TSEL                        941
#define C1TSEL1                       942
#define C2TSEL0                       943
#define C2TSEL                        944
#define C2TSEL1                       945
#define C7TSEL                        946
#define C7TSEL0                       947
#define C7TSEL1                       948
#define C8TSEL                        949
#define CCPTMRS2                      950
#define P3TSEL                        951
#define P3TSEL0                       952
#define P3TSEL1                       953
#define P4TSEL0                       954
#define P4TSEL                        955
#define P4TSEL1                       956
#define P9TSEL0                       957
#define P9TSEL                        958
#define P9TSEL1                       959
#define P10TSEL                       960
#define SLRCONA                       961
#define SLRA0                         962
#define SLRA1                         963
#define SLRA2                         964
#define SLRA3                         965
#define SLRA4                         966
#define SLRA5                         967
#define SLRA6                         968
#define SLRA7                         969
#define SLRCONB                       970
#define SLRB0                         971
#define SLRB1                         972
#define SLRB2                         973
#define SLRB3                         974
#define SLRB4                         975
#define SLRB5                         976
#define SLRB6                         977
#define SLRB7                         978
#define SLRCONC                       979
#define SLRC0                         980
#define SLRC1                         981
#define SLRC2                         982
#define SLRC3                         983
#define SLRC4                         984
#define SLRC5                         985
#define SLRC6                         986
#define SLRC7                         987
#define SLRCOND                       988
#define SLRD0                         989
#define SLRD1                         990
#define SLRD2                         991
#define SLRD3                         992
#define SLRD4                         993
#define SLRD5                         994
#define SLRD6                         995
#define SLRD7                         996
#define SLRCONE                       997
#define SLRE0                         998
#define SLRE1                         999
#define SLRE2                         1000
#define CCPR8L                        1001
#define CCPR8L_RL                     1002
#define CCPR8H                        1003
#define CCPR8H_RH                     1004
#define CCP8CON                       1005
#define CCP8MODE0                     1006
#define CCP8CON_MODE0                 1007
#define CCP8CON_MODE                  1008
#define CCP8MODE                      1009
#define CCP8MODE1                     1010
#define CCP8CON_MODE1                 1011
#define CCP8MODE2                     1012
#define CCP8CON_MODE2                 1013
#define CCP8MODE3                     1014
#define CCP8CON_MODE3                 1015
#define CCP8CON_FMT                   1016
#define CCP8FMT                       1017
#define CCP8CON_OUT                   1018
#define CCP8OUT                       1019
#define CCP8CON_EN                    1020
#define CCP8EN                        1021
#define CCP8CAP                       1022
#define CCP8CAP_CTS                   1023
#define CCP8CTS0                      1024
#define CCP8CAP_CTS0                  1025
#define CCP8CTS                       1026
#define CCP8CTS1                      1027
#define CCP8CAP_CTS1                  1028
#define CCP8CTS2                      1029
#define CCP8CAP_CTS2                  1030
#define CCP8CTS3                      1031
#define CCP8CAP_CTS3                  1032
#define MD1CON0                       1033
#define MD1BIT                        1034
#define MD1CON0_BIT                   1035
#define MD1OPOL                       1036
#define MD1CON0_OPOL                  1037
#define MD1CON0_OUT                   1038
#define MD1OUT                        1039
#define MD1CON0_EN                    1040
#define MD1EN                         1041
#define MD1CON1                       1042
#define MD1CLSYNC                     1043
#define MD1CON1_CLSYNC                1044
#define MD1CON1_CLPOL                 1045
#define MD1CLPOL                      1046
#define MD1CON1_CHSYNC                1047
#define MD1CHSYNC                     1048
#define MD1CHPOL                      1049
#define MD1CON1_CHPOL                 1050
#define MD1SRC                        1051
#define MD1MS0                        1052
#define MD1SRC_MS0                    1053
#define MD1MS                         1054
#define MD1SRC_MS                     1055
#define MD1MS1                        1056
#define MD1SRC_MS1                    1057
#define MD1MS2                        1058
#define MD1SRC_MS2                    1059
#define MD1MS3                        1060
#define MD1SRC_MS3                    1061
#define MD1MS4                        1062
#define MD1SRC_MS4                    1063
#define MD1CARL                       1064
#define MD1CL                         1065
#define MD1CARL_CL0                   1066
#define MD1CL0                        1067
#define MD1CARL_CL                    1068
#define MD1CARL_CL1                   1069
#define MD1CL1                        1070
#define MD1CARL_CL2                   1071
#define MD1CL2                        1072
#define MD1CARL_CL3                   1073
#define MD1CL3                        1074
#define MD1CARL_CL4                   1075
#define MD1CARH                       1076
#define MD1CARH_CH                    1077
#define MD1CH                         1078
#define MD1CH0                        1079
#define MD1CARH_CH0                   1080
#define MD1CH1                        1081
#define MD1CARH_CH1                   1082
#define MD1CH2                        1083
#define MD1CARH_CH2                   1084
#define MD1CH3                        1085
#define MD1CARH_CH3                   1086
#define MD1CARH_CH4                   1087
#define MD2CON0                       1088
#define MD2BIT                        1089
#define MD2CON0_BIT                   1090
