tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1779_tdd.h
#define MD2CON0_OPOL                  1091
#define MD2OPOL                       1092
#define MD2CON0_OUT                   1093
#define MD2OUT                        1094
#define MD2CON0_EN                    1095
#define MD2EN                         1096
#define MD2CON1                       1097
#define MD2CLSYNC                     1098
#define MD2CON1_CLSYNC                1099
#define MD2CON1_CLPOL                 1100
#define MD2CLPOL                      1101
#define MD2CON1_CHSYNC                1102
#define MD2CHSYNC                     1103
#define MD2CHPOL                      1104
#define MD2CON1_CHPOL                 1105
#define MD2SRC                        1106
#define MD2MS                         1107
#define MD2MS0                        1108
#define MD2SRC_MS0                    1109
#define MD2SRC_MS                     1110
#define MD2SRC_MS1                    1111
#define MD2MS1                        1112
#define MD2MS2                        1113
#define MD2SRC_MS2                    1114
#define MD2MS3                        1115
#define MD2SRC_MS3                    1116
#define MD2MS4                        1117
#define MD2SRC_MS4                    1118
#define MD2CARL                       1119
#define MD2CARL_CL                    1120
#define MD2CL0                        1121
#define MD2CARL_CL0                   1122
#define MD2CL                         1123
#define MD2CARL_CL1                   1124
#define MD2CL1                        1125
#define MD2CL2                        1126
#define MD2CARL_CL2                   1127
#define MD2CL3                        1128
#define MD2CARL_CL3                   1129
#define MD2CARL_CL4                   1130
#define MD2CARH                       1131
#define MD2CARH_CH0                   1132
#define MD2CH0                        1133
#define MD2CARH_CH                    1134
#define MD2CH                         1135
#define MD2CARH_CH1                   1136
#define MD2CH1                        1137
#define MD2CARH_CH2                   1138
#define MD2CH2                        1139
#define MD2CARH_CH3                   1140
#define MD2CH3                        1141
#define MD2CARH_CH4                   1142
#define INLVLA                        1143
#define INLVLA0                       1144
#define INLVLA1                       1145
#define INLVLA2                       1146
#define INLVLA3                       1147
#define INLVLA4                       1148
#define INLVLA5                       1149
#define INLVA6                        1150
#define INLVA7                        1151
#define INLVLB                        1152
#define INLVB0                        1153
#define INLVB1                        1154
#define INLVB2                        1155
#define INLVB3                        1156
#define INLVLB4                       1157
#define INLVLB5                       1158
#define INLVLB6                       1159
#define INLVLB7                       1160
#define INLVLC                        1161
#define INLVLC0                       1162
#define INLVLC1                       1163
#define INLVLC2                       1164
#define INLVLC3                       1165
#define INLVLC4                       1166
#define INLVLC5                       1167
#define INLVLC6                       1168
#define INLVLC7                       1169
#define INLVLD                        1170
#define INLVLD0                       1171
#define INLVLD1                       1172
#define INLVLD2                       1173
#define INLVLD3                       1174
#define INLVLD4                       1175
#define INLVLD5                       1176
#define INLVLD6                       1177
#define INLVLD7                       1178
#define INLVE                         1179
#define INLVE0                        1180
#define INLVE1                        1181
#define INLVE2                        1182
#define INLVE3                        1183
#define IOCAP                         1184
#define IOCAP0                        1185
#define IOCAP1                        1186
#define IOCAP2                        1187
#define IOCAP3                        1188
#define IOCAP4                        1189
#define IOCAP5                        1190
#define IOCAP6                        1191
#define IOCAP7                        1192
#define IOCAN                         1193
#define IOCAN0                        1194
#define IOCAN1                        1195
#define IOCAN2                        1196
#define IOCAN3                        1197
#define IOCAN4                        1198
#define IOCAN5                        1199
#define IOCAN6                        1200
#define IOCAN7                        1201
#define IOCAF                         1202
#define IOCAF0                        1203
#define IOCAF1                        1204
#define IOCAF2                        1205
#define IOCAF3                        1206
#define IOCAF4                        1207
#define IOCAF5                        1208
#define IOCAF6                        1209
#define IOCAF7                        1210
#define IOCBP                         1211
#define IOCBP0                        1212
#define IOCBP1                        1213
#define IOCBP2                        1214
#define IOCBP3                        1215
#define IOCBP4                        1216
#define IOCBP5                        1217
#define IOCBP6                        1218
#define IOCBP7                        1219
#define IOCBN                         1220
#define IOCBN0                        1221
#define IOCBN1                        1222
#define IOCBN2                        1223
#define IOCBN3                        1224
#define IOCBN4                        1225
#define IOCBN5                        1226
#define IOCBN6                        1227
#define IOCBN7                        1228
#define IOCBF                         1229
#define IOCBF0                        1230
#define IOCBF1                        1231
#define IOCBF2                        1232
#define IOCBF3                        1233
#define IOCBF4                        1234
#define IOCBF5                        1235
#define IOCBF6                        1236
#define IOCBF7                        1237
#define IOCCP                         1238
#define IOCCP0                        1239
#define IOCCP1                        1240
#define IOCCP2                        1241
#define IOCCP3                        1242
#define IOCCP4                        1243
#define IOCCP5                        1244
#define IOCCP6                        1245
#define IOCCP7                        1246
#define IOCCN                         1247
#define IOCCN0                        1248
#define IOCCN1                        1249
#define IOCCN2                        1250
#define IOCCN3                        1251
#define IOCCN4                        1252
#define IOCCN5                        1253
#define IOCCN6                        1254
#define IOCCN7                        1255
#define IOCCF                         1256
#define IOCCF0                        1257
#define IOCCF1                        1258
#define IOCCF2                        1259
#define IOCCF3                        1260
#define IOCCF4                        1261
#define IOCCF5                        1262
#define IOCCF6                        1263
#define IOCCF7                        1264
#define IOCEP                         1265
#define IOCEP3                        1266
#define IOCEN                         1267
#define IOCEN3                        1268
#define IOCEF                         1269
#define IOCEF3                        1270
#define HIDRVB                        1271
#define HIDB0                         1272
#define HIDB1                         1273
#define TMR5L                         1274
#define TMR5L_TMR                     1275
#define TMR5H                         1276
#define TMR5H_TMR                     1277
#define T5CON                         1278
#define TMR5ON                        1279
#define T5CON_ON                      1280
#define T5ON                          1281
#define T5CON_TMRON                   1282
#define T5CON_SYNC                    1283
#define T5CON_nSYNC                   1284
#define nT5SYNC                       1285
#define T5CON_SOSCEN                  1286
#define T5OSCEN                       1287
#define T5CON_OSCEN                   1288
#define T5CON_CKPS                    1289
#define T5CON_CKPS0                   1290
#define T5CKPS0                       1291
#define T5CON_CKPS1                   1292
#define T5CKPS1                       1293
#define T5CON_CS0                     1294
#define T5CON_CS                      1295
#define T5CS0                         1296
#define TMR5CS0                       1297
#define T5CON_CS1                     1298
#define T5CS1                         1299
#define TMR5CS1                       1300
#define T5GCON                        1301
#define T5GSS0                        1302
#define T5GCON_GSS0                   1303
#define T5GCON_GSS                    1304
#define T5GSS1                        1305
#define T5GCON_GSS1                   1306
#define T5GVAL                        1307
#define T5GCON_GVAL                   1308
#define T5GCON_GGO_nDONE              1309
#define T5GGO_nDONE                   1310
#define T5GSPM                        1311
#define T5GCON_GSPM                   1312
#define T5GTM                         1313
#define T5GCON_GTM                    1314
#define T5GPOL                        1315
#define T5GCON_GPOL                   1316
#define T5GE                          1317
#define TMR5GE                        1318
#define T5GCON_GE                     1319
#define T4TMR                         1320
#define TMR4                          1321
#define T4TMR_TMR                     1322
#define T4PR_PR                       1323
#define T4PR                          1324
#define T4CON                         1325
#define T4CON_OUTPS                   1326
#define T4OUTPS0                      1327
#define T4OUTPS                       1328
#define T4CON_OUTPS0                  1329
#define T4OUTPS1                      1330
#define T4CON_OUTPS1                  1331
#define T4CON_OUTPS2                  1332
#define T4OUTPS2                      1333
#define T4OUTPS3                      1334
#define T4CON_OUTPS3                  1335
#define T4CKPS0                       1336
#define T4CON_CKPS0                   1337
#define T4CKPS                        1338
#define T4CON_CKPS                    1339
#define T4CKPS1                       1340
#define T4CON_CKPS1                   1341
#define T4CKPS2                       1342
#define T4CON_CKPS2                   1343
#define T4CON_ON                      1344
#define T4ON                          1345
#define TMR4ON                        1346
#define T4HLT                         1347
#define T4MODE                        1348
#define T4HLT_MODE                    1349
#define T4HLT_MODE0                   1350
#define T4MODE0                       1351
#define T4HLT_MODE1                   1352
#define T4MODE1                       1353
#define T4HLT_MODE2                   1354
#define T4MODE2                       1355
#define T4HLT_MODE3                   1356
#define T4MODE3                       1357
#define T4HLT_MODE4                   1358
#define T4MODE4                       1359
#define T4HLT_CKSYNC                  1360
#define T4CKSYNC                      1361
#define T4HLT_CKPOL                   1362
#define T4CKPOL                       1363
#define T4HLT_PSYNC                   1364
#define T4PSYNC                       1365
#define T4CLKCON                      1366
#define T4CS                          1367
#define T4CLKCON_CS                   1368
#define T4CS0                         1369
#define T4CLKCON_CS0                  1370
#define T4CS1                         1371
#define T4CLKCON_CS1                  1372
#define T4CS2                         1373
#define T4CLKCON_CS2                  1374
#define T4CS3                         1375
#define T4CLKCON_CS3                  1376
#define T4RST                         1377
#define T4RST_RSEL                    1378
#define T4RSEL0                       1379
#define T4RSEL                        1380
#define T4RST_RSEL0                   1381
#define T4RSEL1                       1382
#define T4RST_RSEL1                   1383
#define T4RSEL2                       1384
#define T4RST_RSEL2                   1385
#define T4RSEL3                       1386
#define T4RST_RSEL3                   1387
#define T4RSEL4                       1388
#define T4RST_RSEL4                   1389
#define T6TMR                         1390
#define TMR6                          1391
#define T6TMR_TMR                     1392
#define T6PR_PR                       1393
#define T6PR                          1394
#define T6CON                         1395
#define T6CON_OUTPS0                  1396
#define T6OUTPS                       1397
#define T6CON_OUTPS                   1398
#define T6OUTPS0                      1399
#define T6CON_OUTPS1                  1400
#define T6OUTPS1                      1401
#define T6CON_OUTPS2                  1402
#define T6OUTPS2                      1403
#define T6CON_OUTPS3                  1404
#define T6OUTPS3                      1405
#define T6CON_CKPS0                   1406
#define T6CKPS                        1407
#define T6CKPS0                       1408
#define T6CON_CKPS                    1409
#define T6CON_CKPS1                   1410
#define T6CKPS1                       1411
#define T6CON_CKPS2                   1412
#define T6CKPS2                       1413
#define TMR6ON                        1414
#define T6ON                          1415
#define T6CON_ON                      1416
#define T6HLT                         1417
#define T6HLT_MODE0                   1418
#define T6HLT_MODE                    1419
#define T6MODE0                       1420
#define T6MODE                        1421
#define T6HLT_MODE1                   1422
#define T6MODE1                       1423
#define T6MODE2                       1424
#define T6HLT_MODE2                   1425
#define T6HLT_MODE3                   1426
#define T6MODE3                       1427
#define T6MODE4                       1428
#define T6HLT_MODE4                   1429
#define T6CKSYNC                      1430
#define T6HLT_CKSYNC                  1431
#define T6CKPOL                       1432
#define T6HLT_CKPOL                   1433
#define T6PSYNC                       1434
#define T6HLT_PSYNC                   1435
#define T6CLKCON                      1436
#define T6CS                          1437
#define T6CLKCON_CS                   1438
#define T6CLKCON_CS0                  1439
#define T6CS0                         1440
#define T6CLKCON_CS1                  1441
#define T6CS1                         1442
#define T6CLKCON_CS2                  1443
#define T6CS2                         1444
#define T6CLKCON_CS3                  1445
#define T6CS3                         1446
#define T6RST                         1447
#define T6RST_RSEL                    1448
#define T6RSEL                        1449
#define T6RSEL0                       1450
#define T6RST_RSEL0                   1451
#define T6RST_RSEL1                   1452
#define T6RSEL1                       1453
#define T6RSEL2                       1454
#define T6RST_RSEL2                   1455
#define T6RST_RSEL3                   1456
#define T6RSEL3                       1457
#define T6RST_RSEL4                   1458
#define T6RSEL4                       1459
#define ADRESL                        1460
#define ADRESL_ADRES                  1461
#define ADRESH                        1462
#define ADRESH_ADRES                  1463
#define ADCON0                        1464
#define ADON                          1465
#define ADCON0_GO                     1466
#define CHS                           1467
#define ADCON1                        1468
#define ADPREF                        1469
#define ADNREF                        1470
#define ADCS                          1471
#define ADFM                          1472
#define ADCON2                        1473
#define TRIGSEL                       1474
#define T2TMR                         1475
#define TMR2                          1476
#define T2TMR_TMR                     1477
#define T2PR                          1478
#define T2PR_PR                       1479
#define T2CON                         1480
#define T2OUTPS0                      1481
#define T2CON_OUTPS0                  1482
#define T2OUTPS                       1483
#define T2CON_OUTPS                   1484
#define T2OUTPS1                      1485
#define T2CON_OUTPS1                  1486
#define T2OUTPS2                      1487
#define T2CON_OUTPS2                  1488
#define T2OUTPS3                      1489
#define T2CON_OUTPS3                  1490
#define T2CKPS0                       1491
#define T2CON_CKPS0                   1492
#define T2CON_CKPS                    1493
#define T2CKPS                        1494
#define T2CKPS1                       1495
#define T2CON_CKPS1                   1496
#define T2CKPS2                       1497
#define T2CON_CKPS2                   1498
#define T2CON_ON                      1499
#define TMR2ON                        1500
#define T2ON                          1501
#define T2HLT                         1502
#define T2HLT_MODE                    1503
#define T2MODE                        1504
#define T2MODE0                       1505
#define T2HLT_MODE0                   1506
#define T2MODE1                       1507
#define T2HLT_MODE1                   1508
#define T2MODE2                       1509
#define T2HLT_MODE2                   1510
#define T2MODE3                       1511
#define T2HLT_MODE3                   1512
#define T2MODE4                       1513
#define T2HLT_MODE4                   1514
#define T2HLT_CKSYNC                  1515
#define T2CKSYNC                      1516
#define T2HLT_CKPOL                   1517
#define T2CKPOL                       1518
#define T2PSYNC                       1519
#define T2HLT_PSYNC                   1520
#define T2CLKCON                      1521
#define T2CS                          1522
#define T2CS0                         1523
#define T2CLKCON_CS                   1524
#define T2CLKCON_CS0                  1525
#define T2CS1                         1526
#define T2CLKCON_CS1                  1527
#define T2CS2                         1528
#define T2CLKCON_CS2                  1529
#define T2CS3                         1530
#define T2CLKCON_CS3                  1531
#define T2RST                         1532
#define T2RSEL                        1533
#define T2RST_RSEL                    1534
#define T2RSEL0                       1535
#define T2RST_RSEL0                   1536
#define T2RSEL1                       1537
#define T2RST_RSEL1                   1538
#define T2RST_RSEL2                   1539
#define T2RSEL2                       1540
#define T2RSEL3                       1541
#define T2RST_RSEL3                   1542
#define T2RSEL4                       1543
#define T2RST_RSEL4                   1544
#define T8TMR                         1545
#define T8TMR_TMR                     1546
#define TMR8                          1547
#define T8PR_PR                       1548
#define T8PR                          1549
#define T8CON                         1550
#define T8OUTPS0                      1551
#define T8OUTPS                       1552
#define T8CON_OUTPS                   1553
#define T8CON_OUTPS0                  1554
#define T8OUTPS1                      1555
#define T8CON_OUTPS1                  1556
#define T8OUTPS2                      1557
#define T8CON_OUTPS2                  1558
#define T8OUTPS3                      1559
#define T8CON_OUTPS3                  1560
#define T8CKPS                        1561
#define T8CON_CKPS0                   1562
#define T8CON_CKPS                    1563
#define T8CKPS0                       1564
#define T8CON_CKPS1                   1565
#define T8CKPS1                       1566
#define T8CON_CKPS2                   1567
#define T8CKPS2                       1568
#define T8ON                          1569
#define T8CON_ON                      1570
#define TMR8ON                        1571
#define T8HLT                         1572
#define T8HLT_MODE                    1573
#define T8MODE0                       1574
#define T8MODE                        1575
#define T8HLT_MODE0                   1576
#define T8MODE1                       1577
#define T8HLT_MODE1                   1578
#define T8MODE2                       1579
#define T8HLT_MODE2                   1580
#define T8MODE3                       1581
#define T8HLT_MODE3                   1582
#define T8MODE4                       1583
#define T8HLT_MODE4                   1584
#define T8CKSYNC                      1585
#define T8HLT_CKSYNC                  1586
#define T8HLT_CKPOL                   1587
#define T8CKPOL                       1588
#define T8HLT_PSYNC                   1589
#define T8PSYNC                       1590
#define T8CLKCON                      1591
#define T8CLKCON_CS0                  1592
#define T8CLKCON_CS                   1593
#define T8CS0                         1594
#define T8CS                          1595
#define T8CS1                         1596
#define T8CLKCON_CS1                  1597
#define T8CS2                         1598
#define T8CLKCON_CS2                  1599
#define T8CS3                         1600
#define T8CLKCON_CS3                  1601
#define T8RST                         1602
#define T8RST_RSEL0                   1603
#define T8RST_RSEL                    1604
#define T8RSEL                        1605
#define T8RSEL0                       1606
#define T8RST_RSEL1                   1607
#define T8RSEL1                       1608
#define T8RSEL2                       1609
#define T8RST_RSEL2                   1610
#define T8RSEL3                       1611
#define T8RST_RSEL3                   1612
#define T8RSEL4                       1613
#define T8RST_RSEL4                   1614
#define OPA1NCHS                      1615
#define OPA1NCH                       1616
#define OPA1NCHS_NCH                  1617
#define OPA1PCHS                      1618
#define OPA1PCHS_PCH                  1619
#define OPA1PCH                       1620
#define OPA1CON                       1621
#define OPA1CON_ORM                   1622
#define OPA1ORM0                      1623
#define OPA1CON_ORM0                  1624
#define OPA1ORM                       1625
#define OPA1ORM1                      1626
#define OPA1CON_ORM1                  1627
#define OPA1CON_ORPOL                 1628
#define OPA1ORPOL                     1629
#define OPA1CON_UG                    1630
#define OPA1UG                        1631
#define OPA1CON_EN                    1632
#define OPA1EN                        1633
#define OPA1ORS                       1634
#define OPA1ORS_ORS                   1635
#define OPA2NCHS                      1636
#define OPA2NCHS_NCH                  1637
#define OPA2NCH                       1638
#define OPA2PCHS                      1639
#define OPA2PCHS_PCH                  1640
#define OPA2PCH                       1641
#define OPA2CON                       1642
#define OPA2CON_ORM0                  1643
#define OPA2ORM                       1644
#define OPA2ORM0                      1645
#define OPA2CON_ORM                   1646
#define OPA2CON_ORM1                  1647
#define OPA2ORM1                      1648
