tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1779_tdd.h
#define G1FIS10                       2765
#define COG1FIS1_FIS10                2766
#define G1FIS11                       2767
#define COG1FIS1_FIS11                2768
#define G1FIS12                       2769
#define COG1FIS1_FIS12                2770
#define G1FIS13                       2771
#define COG1FIS1_FIS13                2772
#define G1FIS14                       2773
#define COG1FIS1_FIS14                2774
#define G1FIS15                       2775
#define COG1FIS1_FIS15                2776
#define COG1FSIM0                     2777
#define COG1FSIM0_FSIM0               2778
#define G1FSIM0                       2779
#define COG1FSIM0_FSIM1               2780
#define G1FSIM1                       2781
#define COG1FSIM0_FSIM2               2782
#define G1FSIM2                       2783
#define COG1FSIM0_FSIM3               2784
#define G1FSIM3                       2785
#define COG1FSIM0_FSIM4               2786
#define G1FSIM4                       2787
#define COG1FSIM0_FSIM5               2788
#define G1FSIM5                       2789
#define COG1FSIM0_FSIM6               2790
#define G1FSIM6                       2791
#define COG1FSIM0_FSIM7               2792
#define G1FSIM7                       2793
#define COG1FSIM1                     2794
#define COG1FSIM1_FSIM8               2795
#define G1FSIM8                       2796
#define COG1FSIM1_FSIM9               2797
#define G1FSIM9                       2798
#define COG1FSIM1_FSIM10              2799
#define G1FSIM10                      2800
#define COG1FSIM1_FSIM11              2801
#define G1FSIM11                      2802
#define COG1FSIM1_FSIM12              2803
#define G1FSIM12                      2804
#define COG1FSIM1_FSIM13              2805
#define G1FSIM13                      2806
#define COG1FSIM1_FSIM14              2807
#define G1FSIM14                      2808
#define COG1FSIM1_FSIM15              2809
#define G1FSIM15                      2810
#define COG1ASD0                      2811
#define COG1ASD0_ASDAC0               2812
#define G1ASDAC0                      2813
#define COG1ASD0_ASDAC                2814
#define G1ASDAC                       2815
#define COG1ASD0_ASDAC1               2816
#define G1ASDAC1                      2817
#define G1ASDBD0                      2818
#define COG1ASD0_ASDBD0               2819
#define G1ASDBD                       2820
#define COG1ASD0_ASDBD                2821
#define G1ASDBD1                      2822
#define COG1ASD0_ASDBD1               2823
#define G1ASREN                       2824
#define COG1ASD0_ARSEN                2825
#define G1ARSEN                       2826
#define COG1ASD0_ASREN                2827
#define COG1ASD0_ASE                  2828
#define G1ASE                         2829
#define COG1ASD1                      2830
#define COG1ASD1_AS0E                 2831
#define G1AS0E                        2832
#define G1AS1E                        2833
#define COG1ASD1_AS1E                 2834
#define COG1ASD1_AS2E                 2835
#define G1AS2E                        2836
#define COG1ASD1_AS3E                 2837
#define G1AS3E                        2838
#define G1AS4E                        2839
#define COG1ASD1_AS4E                 2840
#define G1AS5E                        2841
#define COG1ASD1_AS5E                 2842
#define G1AS6E                        2843
#define COG1ASD1_AS6E                 2844
#define G1AS7E                        2845
#define COG1ASD1_AS7E                 2846
#define COG1STR                       2847
#define G1STRA                        2848
#define COG1STR_STRA                  2849
#define G1STRB                        2850
#define COG1STR_STRB                  2851
#define G1STRC                        2852
#define COG1STR_STRC                  2853
#define G1STRD                        2854
#define COG1STR_STRD                  2855
#define COG1STR_SDATA                 2856
#define G1SDATA                       2857
#define COG1STR_SDATB                 2858
#define G1SDATB                       2859
#define COG1STR_SDATC                 2860
#define G1SDATC                       2861
#define COG1STR_SDATD                 2862
#define G1SDATD                       2863
#define COG2PHR                       2864
#define G2PHR0                        2865
#define COG2PHR_PHR                   2866
#define COG2PHR_PHR0                  2867
#define G2PHR1                        2868
#define COG2PHR_PHR1                  2869
#define G2PHR2                        2870
#define COG2PHR_PHR2                  2871
#define G2PHR3                        2872
#define COG2PHR_PHR3                  2873
#define G2PHR4                        2874
#define COG2PHR_PHR4                  2875
#define G2PHR5                        2876
#define COG2PHR_PHR5                  2877
#define COG2PHF                       2878
#define COG2PHF_PHF                   2879
#define COG2PHF_PHF0                  2880
#define G2PHF0                        2881
#define COG2PHF_PHF1                  2882
#define G2PHF1                        2883
#define COG2PHF_PHF2                  2884
#define G2PHF2                        2885
#define G2PHF3                        2886
#define COG2PHF_PHF3                  2887
#define COG2PHF_PHF4                  2888
#define G2PHF4                        2889
#define COG2PHF_PHF5                  2890
#define G2PHF5                        2891
#define COG2BLKR                      2892
#define G2BLKR0                       2893
#define COG2BLKR_BLKR                 2894
#define COG2BLKR_BLKR0                2895
#define G2BLKR1                       2896
#define COG2BLKR_BLKR1                2897
#define G2BLKR2                       2898
#define COG2BLKR_BLKR2                2899
#define G2BLKR3                       2900
#define COG2BLKR_BLKR3                2901
#define G2BLKR4                       2902
#define COG2BLKR_BLKR4                2903
#define G2BLKR5                       2904
#define COG2BLKR_BLKR5                2905
#define COG2BLKF                      2906
#define COG2BLKF_BLKF                 2907
#define G2BLKF0                       2908
#define COG2BLKF_BLKF0                2909
#define COG2BLKF_BLKF1                2910
#define G2BLKF1                       2911
#define COG2BLKF_BLKF2                2912
#define G2BLKF2                       2913
#define COG2BLKF_BLKF3                2914
#define G2BLKF3                       2915
#define COG2BLKF_BLKF4                2916
#define G2BLKF4                       2917
#define COG2BLKF_BLKF5                2918
#define G2BLKF5                       2919
#define COG2DBR                       2920
#define COG2DBR_DBR0                  2921
#define G2DBR0                        2922
#define COG2DBR_DBR                   2923
#define COG2DBR_DBR1                  2924
#define G2DBR1                        2925
#define COG2DBR_DBR2                  2926
#define G2DBR2                        2927
#define COG2DBR_DBR3                  2928
#define G2DBR3                        2929
#define COG2DBR_DBR4                  2930
#define G2DBR4                        2931
#define COG2DBR_DBR5                  2932
#define G2DBR5                        2933
#define COG2DBF                       2934
#define G2DBF                         2935
#define G2DBF0                        2936
#define COG2DBF_DBF0                  2937
#define G2DBF1                        2938
#define COG2DBF_DBF1                  2939
#define G2DBF2                        2940
#define COG2DBF_DBF2                  2941
#define G2DBF3                        2942
#define COG2DBF_DBF3                  2943
#define G2DBF4                        2944
#define COG2DBF_DBF4                  2945
#define G2DBF5                        2946
#define COG2DBF_DBF5                  2947
#define COG2CON0                      2948
#define COG2CON0_MD0                  2949
#define G2MD                          2950
#define G2MD0                         2951
#define COG2CON0_MD                   2952
#define COG2CON0_MD1                  2953
#define G2MD1                         2954
#define COG2CON0_MD2                  2955
#define G2MD2                         2956
#define G2CS                          2957
#define COG2CON0_CS                   2958
#define COG2CON0_CS0                  2959
#define G2CS0                         2960
#define COG2CON0_CS1                  2961
#define G2CS1                         2962
#define COG2CON0_LD                   2963
#define G2LD                          2964
#define G2EN                          2965
#define COG2CON0_EN                   2966
#define COG2CON1                      2967
#define G2POLA                        2968
#define COG2CON1_POLA                 2969
#define G2POLB                        2970
#define COG2CON1_POLB                 2971
#define G2POLC                        2972
#define COG2CON1_POLC                 2973
#define G2POLD                        2974
#define COG2CON1_POLD                 2975
#define COG2CON1_FDBS                 2976
#define G2FDBS                        2977
#define G2RDBS                        2978
#define COG2CON1_RDBS                 2979
#define COG2RIS0                      2980
#define G2RIS0                        2981
#define COG2RIS0_RIS0                 2982
#define G2RIS1                        2983
#define COG2RIS0_RIS1                 2984
#define G2RIS2                        2985
#define COG2RIS0_RIS2                 2986
#define G2RIS3                        2987
#define COG2RIS0_RIS3                 2988
#define G2RIS4                        2989
#define COG2RIS0_RIS4                 2990
#define G2RIS5                        2991
#define COG2RIS0_RIS5                 2992
#define G2RIS6                        2993
#define COG2RIS0_RIS6                 2994
#define G2RIS7                        2995
#define COG2RIS0_RIS7                 2996
#define COG2RIS1                      2997
#define COG2RIS1_RIS8                 2998
#define G2RIS8                        2999
#define COG2RIS1_RIS9                 3000
#define G2RIS9                        3001
#define COG2RIS1_RIS10                3002
#define G2RIS10                       3003
#define COG2RIS1_RIS11                3004
#define G2RIS11                       3005
#define COG2RIS1_RIS12                3006
#define G2RIS12                       3007
#define COG2RIS1_RIS13                3008
#define G2RIS13                       3009
#define COG2RIS1_RIS14                3010
#define G2RIS14                       3011
#define COG2RIS1_RIS15                3012
#define G2RIS15                       3013
#define COG2RSIM0                     3014
#define G2RSIM0                       3015
#define COG2RSIM0_RSIM0               3016
#define G2RSIM1                       3017
#define COG2RSIM0_RSIM1               3018
#define G2RSIM2                       3019
#define COG2RSIM0_RSIM2               3020
#define G2RSIM3                       3021
#define COG2RSIM0_RSIM3               3022
#define G2RSIM4                       3023
#define COG2RSIM0_RSIM4               3024
#define G2RSIM5                       3025
#define COG2RSIM0_RSIM5               3026
#define G2RSIM6                       3027
#define COG2RSIM0_RSIM6               3028
#define G2RSIM7                       3029
#define COG2RSIM0_RSIM7               3030
#define COG2RSIM1                     3031
#define G2RSIM8                       3032
#define COG2RSIM1_RSIM8               3033
#define G2RSIM9                       3034
#define COG2RSIM1_RSIM9               3035
#define COG2RSIM1_RSIM10              3036
#define G2RSIM10                      3037
#define COG2RSIM1_RSIM11              3038
#define G2RSIM11                      3039
#define COG2RSIM1_RSIM12              3040
#define G2RSIM12                      3041
#define COG2RSIM1_RSIM13              3042
#define G2RSIM13                      3043
#define COG2RSIM1_RSIM14              3044
#define G2RSIM14                      3045
#define COG2RSIM1_RSIM15              3046
#define G2RSIM15                      3047
#define COG2FIS0                      3048
#define G2FIS0                        3049
#define COG2FIS0_FIS0                 3050
#define G2FIS1                        3051
#define COG2FIS0_FIS1                 3052
#define G2FIS2                        3053
#define COG2FIS0_FIS2                 3054
#define G2FIS3                        3055
#define COG2FIS0_FIS3                 3056
#define G2FIS4                        3057
#define COG2FIS0_FIS4                 3058
#define G2FIS5                        3059
#define COG2FIS0_FIS5                 3060
#define G2FIS6                        3061
#define COG2FIS0_FIS6                 3062
#define G2FIS7                        3063
#define COG2FIS0_FIS7                 3064
#define COG2FIS1                      3065
#define G2FIS8                        3066
#define COG2FIS1_FIS8                 3067
#define G2FIS9                        3068
#define COG2FIS1_FIS9                 3069
#define COG2FIS1_FIS10                3070
#define G2FIS10                       3071
#define COG2FIS1_FIS11                3072
#define G2FIS11                       3073
#define COG2FIS1_FIS12                3074
#define G2FIS12                       3075
#define COG2FIS1_FIS13                3076
#define G2FIS13                       3077
#define COG2FIS1_FIS14                3078
#define G2FIS14                       3079
#define COG2FIS1_FIS15                3080
#define G2FIS15                       3081
#define COG2FSIM0                     3082
#define COG2FSIM0_FSIM0               3083
#define G2FSIM0                       3084
#define COG2FSIM0_FSIM1               3085
#define G2FSIM1                       3086
#define COG2FSIM0_FSIM2               3087
#define G2FSIM2                       3088
#define COG2FSIM0_FSIM3               3089
#define G2FSIM3                       3090
#define G2FSIM4                       3091
#define COG2FSIM0_FSIM4               3092
#define G2FSIM5                       3093
#define COG2FSIM0_FSIM5               3094
#define COG2FSIM0_FSIM6               3095
#define G2FSIM6                       3096
#define G2FSIM7                       3097
#define COG2FSIM0_FSIM7               3098
#define COG2FSIM1                     3099
#define G2FSIM8                       3100
#define COG2FSIM1_FSIM8               3101
#define G2FSIM9                       3102
#define COG2FSIM1_FSIM9               3103
#define G2FSIM10                      3104
#define COG2FSIM1_FSIM10              3105
#define G2FSIM11                      3106
#define COG2FSIM1_FSIM11              3107
#define G2FSIM12                      3108
#define COG2FSIM1_FSIM12              3109
#define G2FSIM13                      3110
#define COG2FSIM1_FSIM13              3111
#define G2FSIM14                      3112
#define COG2FSIM1_FSIM14              3113
#define G2FSIM15                      3114
#define COG2FSIM1_FSIM15              3115
#define COG2ASD0                      3116
#define COG2ASD0_ASDAC0               3117
#define G2ASDAC                       3118
#define COG2ASD0_ASDAC                3119
#define G2ASDAC0                      3120
#define COG2ASD0_ASDAC1               3121
#define G2ASDAC1                      3122
#define COG2ASD0_ASDBD                3123
#define G2ASDBD0                      3124
#define COG2ASD0_ASDBD0               3125
#define G2ASDBD                       3126
#define G2ASDBD1                      3127
#define COG2ASD0_ASDBD1               3128
#define G2ARSEN                       3129
#define COG2ASD0_ARSEN                3130
#define COG2ASD0_ASREN                3131
#define G2ASREN                       3132
#define COG2ASD0_ASE                  3133
#define G2ASE                         3134
#define COG2ASD1                      3135
#define COG2ASD1_AS0E                 3136
#define G2AS0E                        3137
#define G2AS1E                        3138
#define COG2ASD1_AS1E                 3139
#define COG2ASD1_AS2E                 3140
#define G2AS2E                        3141
#define G2AS3E                        3142
#define COG2ASD1_AS3E                 3143
#define COG2ASD1_AS4E                 3144
#define G2AS4E                        3145
#define COG2ASD1_AS5E                 3146
#define G2AS5E                        3147
#define G2AS6E                        3148
#define COG2ASD1_AS6E                 3149
#define COG2ASD1_AS7E                 3150
#define G2AS7E                        3151
#define COG2STR                       3152
#define COG2STR_STRA                  3153
#define G2STRA                        3154
#define COG2STR_STRB                  3155
#define G2STRB                        3156
#define COG2STR_STRC                  3157
#define G2STRC                        3158
#define COG2STR_STRD                  3159
#define G2STRD                        3160
#define COG2STR_SDATA                 3161
#define G2SDATA                       3162
#define COG2STR_SDATB                 3163
#define G2SDATB                       3164
#define COG2STR_SDATC                 3165
#define G2SDATC                       3166
#define COG2STR_SDATD                 3167
#define G2SDATD                       3168
#define PRG1RTSS                      3169
#define RG1RTSS0                      3170
#define PRG1RTSS_RTSS                 3171
#define PRG1RTSS_RTSS0                3172
#define RG1RTSS1                      3173
#define PRG1RTSS_RTSS1                3174
#define RG1RTSS2                      3175
#define PRG1RTSS_RTSS2                3176
#define RG1RTSS3                      3177
#define PRG1RTSS_RTSS3                3178
#define PRG1FTSS                      3179
#define RG1FTSS0                      3180
#define PRG1FTSS_FTSS                 3181
#define PRG1FTSS_FTSS0                3182
#define RG1FTSS1                      3183
#define PRG1FTSS_FTSS1                3184
#define RG1FTSS2                      3185
#define PRG1FTSS_FTSS2                3186
#define RG1FTSS3                      3187
#define PRG1FTSS_FTSS3                3188
#define PRG1INS                       3189
#define PRG1INS_INS                   3190
#define PRG1INS_INS0                  3191
#define RG1INS0                       3192
#define PRG1INS_INS1                  3193
#define RG1INS1                       3194
#define PRG1INS_INS2                  3195
#define RG1INS2                       3196
#define PRG1INS_INS3                  3197
#define RG1INS3                       3198
#define PRG1CON0                      3199
#define PRG1CON0_GO                   3200
#define RG1GO                         3201
#define RG1OS                         3202
#define PRG1CON0_OS                   3203
#define RG1MODE0                      3204
#define RG1MODE                       3205
#define PRG1CON0_MODE                 3206
#define PRG1CON0_MODE0                3207
#define RG1MODE1                      3208
#define PRG1CON0_MODE1                3209
#define PRG1CON0_REDG                 3210
#define RG1REDG                       3211
#define RG1FEDG                       3212
#define PRG1CON0_FEDG                 3213
#define PRG1CON0_EN                   3214
#define RG1EN                         3215
#define PRG1CON1                      3216
#define PRG1CON1_RPOL                 3217
#define RG1RPOL                       3218
#define PRG1CON1_FPOL                 3219
#define RG1FPOL                       3220
#define PRG1CON1_RDY                  3221
#define RG1RDY                        3222
#define PRG1CON2                      3223
#define RG1ISET0                      3224
#define PRG1CON2_ISET                 3225
#define RG1ISET                       3226
#define PRG1CON2_ISET0                3227
#define RG1ISET1                      3228
#define PRG1CON2_ISET1                3229
#define RG1ISET2                      3230
#define PRG1CON2_ISET2                3231
#define RG1ISET3                      3232
#define PRG1CON2_ISET3                3233
#define RG1ISET4                      3234
#define PRG1CON2_ISET4                3235
#define PRG2RTSS                      3236
#define PRG2RTSS_RTSS                 3237
#define RG2RTSS0                      3238
#define PRG2RTSS_RTSS0                3239
#define RG2RTSS1                      3240
#define PRG2RTSS_RTSS1                3241
#define RG2RTSS2                      3242
#define PRG2RTSS_RTSS2                3243
#define RG2RTSS3                      3244
#define PRG2RTSS_RTSS3                3245
#define PRG2FTSS                      3246
#define RG2FTSS0                      3247
#define PRG2FTSS_FTSS                 3248
#define PRG2FTSS_FTSS0                3249
#define RG2FTSS1                      3250
#define PRG2FTSS_FTSS1                3251
#define PRG2FTSS_FTSS2                3252
#define RG2FTSS2                      3253
#define RG2FTSS3                      3254
#define PRG2FTSS_FTSS3                3255
#define PRG2INS                       3256
#define PRG2INS_INS                   3257
#define PRG2INS_INS0                  3258
#define RG2INS0                       3259
#define PRG2INS_INS1                  3260
#define RG2INS1                       3261
#define PRG2INS_INS2                  3262
#define RG2INS2                       3263
#define PRG2INS_INS3                  3264
#define RG2INS3                       3265
#define PRG2CON0                      3266
#define PRG2CON0_GO                   3267
#define RG2GO                         3268
#define PRG2CON0_OS                   3269
#define RG2OS                         3270
#define RG2MODE0                      3271
#define PRG2CON0_MODE0                3272
#define RG2MODE                       3273
#define PRG2CON0_MODE                 3274
#define RG2MODE1                      3275
#define PRG2CON0_MODE1                3276
#define PRG2CON0_REDG                 3277
#define RG2REDG                       3278
#define RG2FEDG                       3279
#define PRG2CON0_FEDG                 3280
#define PRG2CON0_EN                   3281
#define RG2EN                         3282
#define PRG2CON1                      3283
#define PRG2CON1_RPOL                 3284
#define RG2RPOL                       3285
#define PRG2CON1_FPOL                 3286
#define RG2FPOL                       3287
#define PRG2CON1_RDY                  3288
#define RG2RDY                        3289
#define PRG2CON2                      3290
#define PRG2CON2_ISET                 3291
#define RG2ISET0                      3292
#define PRG2CON2_ISET0                3293
#define RG2ISET                       3294
#define RG2ISET1                      3295
#define PRG2CON2_ISET1                3296
#define RG2ISET2                      3297
#define PRG2CON2_ISET2                3298
#define RG2ISET3                      3299
#define PRG2CON2_ISET3                3300
#define PRG2CON2_ISET4                3301
#define RG2ISET4                      3302
#define PRG3RTSS                      3303
#define PRG3RTSS_RTSS0                3304
#define PRG3RTSS_RTSS                 3305
#define RG3RTSS0                      3306
#define PRG3RTSS_RTSS1                3307
#define RG3RTSS1                      3308
#define PRG3RTSS_RTSS2                3309
#define RG3RTSS2                      3310
#define PRG3RTSS_RTSS3                3311
#define RG3RTSS3                      3312
#define PRG3FTSS                      3313
#define PRG3FTSS_FTSS0                3314
#define RG3FTSS0                      3315
#define PRG3FTSS_FTSS                 3316
#define RG3FTSS1                      3317
#define PRG3FTSS_FTSS1                3318
#define RG3FTSS2                      3319
#define PRG3FTSS_FTSS2                3320
#define RG3FTSS3                      3321
#define PRG3FTSS_FTSS3                3322
