tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1779_tdd.h
#define G4FSIM1                       3881
#define COG4FSIM0_FSIM2               3882
#define G4FSIM2                       3883
#define COG4FSIM0_FSIM3               3884
#define G4FSIM3                       3885
#define COG4FSIM0_FSIM4               3886
#define G4FSIM4                       3887
#define COG4FSIM0_FSIM5               3888
#define G4FSIM5                       3889
#define COG4FSIM0_FSIM6               3890
#define G4FSIM6                       3891
#define COG4FSIM0_FSIM7               3892
#define G4FSIM7                       3893
#define COG4FSIM1                     3894
#define G4FSIM8                       3895
#define COG4FSIM1_FSIM8               3896
#define G4FSIM9                       3897
#define COG4FSIM1_FSIM9               3898
#define COG4FSIM1_FSIM10              3899
#define G4FSIM10                      3900
#define COG4FSIM1_FSIM11              3901
#define G4FSIM11                      3902
#define COG4FSIM1_FSIM12              3903
#define G4FSIM12                      3904
#define COG4FSIM1_FSIM13              3905
#define G4FSIM13                      3906
#define COG4FSIM1_FSIM14              3907
#define G4FSIM14                      3908
#define COG4FSIM1_FSIM15              3909
#define G4FSIM15                      3910
#define COG4ASD0                      3911
#define COG4ASD0_ASDAC                3912
#define G4ASDAC0                      3913
#define COG4ASD0_ASDAC0               3914
#define G4ASDAC                       3915
#define G4ASDAC1                      3916
#define COG4ASD0_ASDAC1               3917
#define COG4ASD0_ASDBD0               3918
#define COG4ASD0_ASDBD                3919
#define G4ASDBD                       3920
#define G4ASDBD0                      3921
#define COG4ASD0_ASDBD1               3922
#define G4ASDBD1                      3923
#define G4ARSEN                       3924
#define COG4ASD0_ARSEN                3925
#define COG4ASD0_ASREN                3926
#define G4ASREN                       3927
#define COG4ASD0_ASE                  3928
#define G4ASE                         3929
#define COG4ASD1                      3930
#define G4AS0E                        3931
#define COG4ASD1_AS0E                 3932
#define COG4ASD1_AS1E                 3933
#define G4AS1E                        3934
#define G4AS2E                        3935
#define COG4ASD1_AS2E                 3936
#define COG4ASD1_AS3E                 3937
#define G4AS3E                        3938
#define G4AS4E                        3939
#define COG4ASD1_AS4E                 3940
#define COG4ASD1_AS5E                 3941
#define G4AS5E                        3942
#define COG4ASD1_AS6E                 3943
#define G4AS6E                        3944
#define COG4ASD1_AS7E                 3945
#define G4AS7E                        3946
#define COG4STR                       3947
#define COG4STR_STRA                  3948
#define G4STRA                        3949
#define COG4STR_STRB                  3950
#define G4STRB                        3951
#define COG4STR_STRC                  3952
#define G4STRC                        3953
#define COG4STR_STRD                  3954
#define G4STRD                        3955
#define G4SDATA                       3956
#define COG4STR_SDATA                 3957
#define G4SDATB                       3958
#define COG4STR_SDATB                 3959
#define G4SDATC                       3960
#define COG4STR_SDATC                 3961
#define G4SDATD                       3962
#define COG4STR_SDATD                 3963
#define CM4CON0                       3964
#define CM4CON0_SYNC                  3965
#define C4SYNC                        3966
#define C4HYS                         3967
#define CM4CON0_HYS                   3968
#define C4SP                          3969
#define C4ZLF                         3970
#define CM4CON0_ZLF                   3971
#define C4POL                         3972
#define CM4CON0_POL                   3973
#define C4OUT                         3974
#define CM4CON0_OUT                   3975
#define C4ON                          3976
#define CM4CON0_ON                    3977
#define CM4CON1                       3978
#define C4INTN                        3979
#define CM4CON1_INTN                  3980
#define CM4CON1_INTP                  3981
#define C4INTP                        3982
#define CM4NSEL                       3983
#define CM4NSEL_NCH                   3984
#define C4NCH0                        3985
#define C4NCH                         3986
#define C4NCH1                        3987
#define C4NCH2                        3988
#define C4NCH3                        3989
#define CM4PSEL                       3990
#define CM4PSEL_PCH0                  3991
#define C4PCH0                        3992
#define C4PCH                         3993
#define CM4PSEL_PCH                   3994
#define CM4PSEL_PCH1                  3995
#define C4PCH1                        3996
#define CM4PSEL_PCH2                  3997
#define C4PCH2                        3998
#define CM4PSEL_PCH3                  3999
#define C4PCH3                        4000
#define CM5CON0                       4001
#define CM5CON0_SYNC                  4002
#define C5SYNC                        4003
#define C5HYS                         4004
#define CM5CON0_HYS                   4005
#define C5SP                          4006
#define CM5CON0_ZLF                   4007
#define C5ZLF                         4008
#define C5POL                         4009
#define CM5CON0_POL                   4010
#define CM5CON0_OUT                   4011
#define C5OUT                         4012
#define CM5CON0_ON                    4013
#define C5ON                          4014
#define CM5CON1                       4015
#define CM5CON1_INTN                  4016
#define C5INTN                        4017
#define CM5CON1_INTP                  4018
#define C5INTP                        4019
#define CM5NSEL                       4020
#define C5NCH                         4021
#define CM5NSEL_NCH                   4022
#define C5NCH0                        4023
#define C5NCH1                        4024
#define C5NCH2                        4025
#define C5NCH3                        4026
#define CM5PSEL                       4027
#define C5PCH                         4028
#define CM5PSEL_PCH                   4029
#define C5PCH0                        4030
#define CM5PSEL_PCH0                  4031
#define C5PCH1                        4032
#define CM5PSEL_PCH1                  4033
#define C5PCH2                        4034
#define CM5PSEL_PCH2                  4035
#define C5PCH3                        4036
#define CM5PSEL_PCH3                  4037
#define CM6CON0                       4038
#define C6SYNC                        4039
#define CM6CON0_SYNC                  4040
#define C6HYS                         4041
#define CM6CON0_HYS                   4042
#define C6SP                          4043
#define CM6CON0_ZLF                   4044
#define C6ZLF                         4045
#define CM6CON0_POL                   4046
#define C6POL                         4047
#define C6OUT                         4048
#define CM6CON0_OUT                   4049
#define CM6CON0_ON                    4050
#define C6ON                          4051
#define CM6CON1                       4052
#define C6INTN                        4053
#define CM6CON1_INTN                  4054
#define CM6CON1_INTP                  4055
#define C6INTP                        4056
#define CM6NSEL                       4057
#define C6NCH                         4058
#define C6NCH0                        4059
#define CM6NSEL_NCH                   4060
#define C6NCH1                        4061
#define C6NCH2                        4062
#define C6NCH3                        4063
#define CM6PSEL                       4064
#define C6PCH                         4065
#define CM6PSEL_PCH0                  4066
#define CM6PSEL_PCH                   4067
#define C6PCH0                        4068
#define CM6PSEL_PCH1                  4069
#define C6PCH1                        4070
#define CM6PSEL_PCH2                  4071
#define C6PCH2                        4072
#define C6PCH3                        4073
#define CM6PSEL_PCH3                  4074
#define CM7CON0                       4075
#define CM7CON0_SYNC                  4076
#define C7SYNC                        4077
#define CM7CON0_HYS                   4078
#define C7HYS                         4079
#define C7SP                          4080
#define CM7CON0_ZLF                   4081
#define C7ZLF                         4082
#define CM7CON0_POL                   4083
#define C7POL                         4084
#define C7OUT                         4085
#define CM7CON0_OUT                   4086
#define CM7CON0_ON                    4087
#define C7ON                          4088
#define CM7CON1                       4089
#define CM7CON1_INTN                  4090
#define C7INTN                        4091
#define C7INTP                        4092
#define CM7CON1_INTP                  4093
#define CM7NSEL                       4094
#define C7NCH                         4095
#define CM7NSEL_NCH                   4096
#define C7NCH0                        4097
#define C7NCH1                        4098
#define C7NCH2                        4099
#define C7NCH3                        4100
#define CM7PSEL                       4101
#define C7PCH0                        4102
#define CM7PSEL_PCH                   4103
#define CM7PSEL_PCH0                  4104
#define C7PCH                         4105
#define C7PCH1                        4106
#define CM7PSEL_PCH1                  4107
#define CM7PSEL_PCH2                  4108
#define C7PCH2                        4109
#define C7PCH3                        4110
#define CM7PSEL_PCH3                  4111
#define CM8CON0                       4112
#define C8SYNC                        4113
#define CM8CON0_SYNC                  4114
#define CM8CON0_HYS                   4115
#define C8HYS                         4116
#define C8SP                          4117
#define C8ZLF                         4118
#define CM8CON0_ZLF                   4119
#define CM8CON0_POL                   4120
#define C8POL                         4121
#define C8OUT                         4122
#define CM8CON0_OUT                   4123
#define CM8CON0_ON                    4124
#define C8ON                          4125
#define CM8CON1                       4126
#define C8INTN                        4127
#define CM8CON1_INTN                  4128
#define CM8CON1_INTP                  4129
#define C8INTP                        4130
#define CM8NSEL                       4131
#define C8NCH0                        4132
#define C8NCH                         4133
#define CM8NSEL_NCH                   4134
#define C8NCH1                        4135
#define C8NCH2                        4136
#define C8NCH3                        4137
#define CM8PSEL                       4138
#define CM8PSEL_PCH                   4139
#define CM8PSEL_PCH0                  4140
#define C8PCH                         4141
#define C8PCH0                        4142
#define CM8PSEL_PCH1                  4143
#define C8PCH1                        4144
#define CM8PSEL_PCH2                  4145
#define C8PCH2                        4146
#define CM8PSEL_PCH3                  4147
#define C8PCH3                        4148
#define MD4CON0                       4149
#define MD4BIT                        4150
#define MD4CON0_BIT                   4151
#define MD4CON0_OPOL                  4152
#define MD4OPOL                       4153
#define MD4OUT                        4154
#define MD4CON0_OUT                   4155
#define MD4CON0_EN                    4156
#define MD4EN                         4157
#define MD4CON1                       4158
#define MD4CLSYNC                     4159
#define MD4CON1_CLSYNC                4160
#define MD4CLPOL                      4161
#define MD4CON1_CLPOL                 4162
#define MD4CHSYNC                     4163
#define MD4CON1_CHSYNC                4164
#define MD4CHPOL                      4165
#define MD4CON1_CHPOL                 4166
#define MD4SRC                        4167
#define MD4MS0                        4168
#define MD4SRC_MS                     4169
#define MD4MS                         4170
#define MD4SRC_MS0                    4171
#define MD4MS1                        4172
#define MD4SRC_MS1                    4173
#define MD4MS2                        4174
#define MD4SRC_MS2                    4175
#define MD4MS3                        4176
#define MD4SRC_MS3                    4177
#define MD4MS4                        4178
#define MD4SRC_MS4                    4179
#define MD4CARL                       4180
#define MD4CL0                        4181
#define MD4CL                         4182
#define MD4CARL_CL0                   4183
#define MD4CARL_CL                    4184
#define MD4CL1                        4185
#define MD4CARL_CL1                   4186
#define MD4CL2                        4187
#define MD4CARL_CL2                   4188
#define MD4CL3                        4189
#define MD4CARL_CL3                   4190
#define MD4CARL_CL4                   4191
#define MD4CARH                       4192
#define MD4CARH_CH0                   4193
#define MD4CH                         4194
#define MD4CH0                        4195
#define MD4CARH_CH                    4196
#define MD4CARH_CH1                   4197
#define MD4CH1                        4198
#define MD4CH2                        4199
#define MD4CARH_CH2                   4200
#define MD4CARH_CH3                   4201
#define MD4CH3                        4202
#define MD4CARH_CH4                   4203
#define PWMEN                         4204
#define MPWM5EN                       4205
#define MPWM6EN                       4206
#define MPWM11EN                      4207
#define MPWM12EN                      4208
#define PWMLD                         4209
#define MPWM5LD                       4210
#define MPWM6LD                       4211
#define MPWM11LD                      4212
#define MPWM12LD                      4213
#define PWMOUT                        4214
#define MPWM5OUT                      4215
#define MPWM6OUT                      4216
#define MPWM11OUT                     4217
#define MPWM12OUT                     4218
#define PWM5PHL0                      4219
#define PWM5PHL_PH                    4220
#define PWM5PHL                       4221
#define PWM5PHL1                      4222
#define PWM5PHL2                      4223
#define PWM5PHL3                      4224
#define PWM5PHL4                      4225
#define PWM5PHL5                      4226
#define PWM5PHL6                      4227
#define PWM5PHL7                      4228
#define PWM5PHH0                      4229
#define PWM5PHH_PH                    4230
#define PWM5PHH                       4231
#define PWM5PHH1                      4232
#define PWM5PHH2                      4233
#define PWM5PHH3                      4234
#define PWM5PHH4                      4235
#define PWM5PHH5                      4236
#define PWM5PHH6                      4237
#define PWM5PHH7                      4238
#define PWM5DCL_DC                    4239
#define PWM5DCL                       4240
#define PWM5DCL0                      4241
#define PWM5DCL1                      4242
#define PWM5DCL2                      4243
#define PWM5DCL3                      4244
#define PWM5DCL4                      4245
#define PWM5DCL5                      4246
#define PWM5DCL6                      4247
#define PWM5DCL7                      4248
#define PWM5DCH_DC                    4249
#define PWM5DCH                       4250
#define PWM5DCH0                      4251
#define PWM5DCH1                      4252
#define PWM5DCH2                      4253
#define PWM5DCH3                      4254
#define PWM5DCH4                      4255
#define PWM5DCH5                      4256
#define PWM5DCH6                      4257
#define PWM5DCH7                      4258
#define PWM5PRL0                      4259
#define PWM5PRL_PR                    4260
#define PWM5PRL                       4261
#define PWM5PRL1                      4262
#define PWM5PRL2                      4263
#define PWM5PRL3                      4264
#define PWM5PRL4                      4265
#define PWM5PRL5                      4266
#define PWM5PRL6                      4267
#define PWM5PRL7                      4268
#define PWM5PRH_PR                    4269
#define PWM5PRH0                      4270
#define PWM5PRH                       4271
#define PWM5PRH1                      4272
#define PWM5PRH2                      4273
#define PWM5PRH3                      4274
#define PWM5PRH4                      4275
#define PWM5PRH5                      4276
#define PWM5PRH6                      4277
#define PWM5PRH7                      4278
#define PWM5OFL                       4279
#define PWM5OFL0                      4280
#define PWM5OFL_OF                    4281
#define PWM5OFL1                      4282
#define PWM5OFL2                      4283
#define PWM5OFL3                      4284
#define PWM5OFL4                      4285
#define PWM5OFL5                      4286
#define PWM5OFL6                      4287
#define PWM5OFL7                      4288
#define PWM5OFH_OF                    4289
#define PWM5OFH                       4290
#define PWM5OFH0                      4291
#define PWM5OFH1                      4292
#define PWM5OFH2                      4293
#define PWM5OFH3                      4294
#define PWM5OFH4                      4295
#define PWM5OFH5                      4296
#define PWM5OFH6                      4297
#define PWM5OFH7                      4298
#define PWM5TMRL_TMR                  4299
#define PWM5TMRL                      4300
#define PWM5TMRL0                     4301
#define PWM5TMRL1                     4302
#define PWM5TMRL2                     4303
#define PWM5TMRL3                     4304
#define PWM5TMRL4                     4305
#define PWM5TMRL5                     4306
#define PWM5TMRL6                     4307
#define PWM5TMRL7                     4308
#define PWM5TMRH0                     4309
#define PWM5TMRH                      4310
#define PWM5TMRH_TMR                  4311
#define PWM5TMRH1                     4312
#define PWM5TMRH2                     4313
#define PWM5TMRH3                     4314
#define PWM5TMRH4                     4315
#define PWM5TMRH5                     4316
#define PWM5TMRH6                     4317
#define PWM5TMRH7                     4318
#define PWM5CON                       4319
#define PWM5MODE0                     4320
#define PWM5CON_MODE                  4321
#define PWM5MODE                      4322
#define PWM5CON_MODE0                 4323
#define PWM5MODE1                     4324
#define PWM5CON_MODE1                 4325
#define PWM5POL                       4326
#define PWM5CON_POL                   4327
#define PWM5OUT                       4328
#define PWM5CON_OUT                   4329
#define PWM5EN                        4330
#define PWM5CON_EN                    4331
#define PWM5INTE                      4332
#define PWM5INTE_PRIE                 4333
#define PWM5PRIE                      4334
#define PWM5INTE_DCIE                 4335
#define PWM5DCIE                      4336
#define PWM5INTE_PHIE                 4337
#define PWM5PHIE                      4338
#define PWM5OFIE                      4339
#define PWM5INTE_OFIE                 4340
#define PWM5INTF                      4341
#define PWM5INTF_PRIF                 4342
#define PWM5PRIF                      4343
#define PWM5INTF_DCIF                 4344
#define PWM5DCIF                      4345
#define PWM5INTF_PHIF                 4346
#define PWM5PHIF                      4347
#define PWM5OFIF                      4348
#define PWM5INTF_OFIF                 4349
#define PWM5CLKCON                    4350
#define PWM5CS0                       4351
#define PWM5CLKCON_CS0                4352
#define PWM5CS                        4353
#define PWM5CLKCON_CS                 4354
#define PWM5CS1                       4355
#define PWM5CLKCON_CS1                4356
#define PWM5CS2                       4357
#define PWM5CLKCON_CS2                4358
#define PWM5PS                        4359
#define PWM5CLKCON_PS0                4360
#define PWM5PS0                       4361
#define PWM5CLKCON_PS                 4362
#define PWM5CLKCON_PS1                4363
#define PWM5PS1                       4364
#define PWM5CLKCON_PS2                4365
#define PWM5PS2                       4366
#define PWM5LDCON                     4367
#define PWM5LDCON_LDS                 4368
#define PWM5LDCON_LDS0                4369
#define PWM5LDS                       4370
#define PWM5LDS0                      4371
#define PWM5LDCON_LDS1                4372
#define PWM5LDS1                      4373
#define PWM5LDCON_LDT                 4374
#define PWM5LDM                       4375
#define PWM5LDCON_LDA                 4376
#define PWM5LD                        4377
#define PWM5OFCON                     4378
#define PWM5OFCON_OFS0                4379
#define PWM5OFCON_OFS                 4380
#define PWM5OFS0                      4381
#define PWM5OFS                       4382
#define PWM5OFCON_OFS1                4383
#define PWM5OFS1                      4384
#define PWM5OFCON_OFO                 4385
#define PWM5OFMC                      4386
#define PWM5OFM                       4387
#define PWM5OFM0                      4388
#define PWM5OFCON_OFM                 4389
#define PWM5OFCON_OFM0                4390
#define PWM5OFM1                      4391
#define PWM5OFCON_OFM1                4392
#define PWM6PHL                       4393
#define PWM6PHL_PH                    4394
#define PWM6PHL0                      4395
#define PWM6PHL1                      4396
#define PWM6PHL2                      4397
#define PWM6PHL3                      4398
#define PWM6PHL4                      4399
#define PWM6PHL5                      4400
#define PWM6PHL6                      4401
#define PWM6PHL7                      4402
#define PWM6PHH0                      4403
#define PWM6PHH                       4404
#define PWM6PHH_PH                    4405
#define PWM6PHH1                      4406
#define PWM6PHH2                      4407
#define PWM6PHH3                      4408
#define PWM6PHH4                      4409
#define PWM6PHH5                      4410
#define PWM6PHH6                      4411
#define PWM6PHH7                      4412
#define PWM6DCL                       4413
#define PWM6DCL_DC                    4414
#define PWM6DCL0                      4415
#define PWM6DCL1                      4416
#define PWM6DCL2                      4417
#define PWM6DCL3                      4418
#define PWM6DCL4                      4419
#define PWM6DCL5                      4420
#define PWM6DCL6                      4421
#define PWM6DCL7                      4422
#define PWM6DCH                       4423
#define PWM6DCH0                      4424
#define PWM6DCH_DC                    4425
#define PWM6DCH1                      4426
#define PWM6DCH2                      4427
#define PWM6DCH3                      4428
#define PWM6DCH4                      4429
#define PWM6DCH5                      4430
#define PWM6DCH6                      4431
#define PWM6DCH7                      4432
#define PWM6PRL0                      4433
#define PWM6PRL                       4434
#define PWM6PRL_PR                    4435
#define PWM6PRL1                      4436
#define PWM6PRL2                      4437
#define PWM6PRL3                      4438
