tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1779_tdd.h
#define LC4D4S2                       5555
#define CLC4SEL3_D4S2                 5556
#define LC4D4S3                       5557
#define CLC4SEL3_D4S3                 5558
#define LC4D4S4                       5559
#define CLC4SEL3_D4S4                 5560
#define LC4D4S5                       5561
#define CLC4SEL3_D4S5                 5562
#define CLC4GLS0                      5563
#define CLC4GLS0_D1N                  5564
#define LC4G1D1N                      5565
#define CLC4GLS0_D1T                  5566
#define LC4G1D1T                      5567
#define CLC4GLS0_D2N                  5568
#define LC4G1D2N                      5569
#define CLC4GLS0_D2T                  5570
#define LC4G1D2T                      5571
#define CLC4GLS0_D3N                  5572
#define LC4G1D3N                      5573
#define CLC4GLS0_D3T                  5574
#define LC4G1D3T                      5575
#define CLC4GLS0_D4N                  5576
#define LC4G1D4N                      5577
#define CLC4GLS0_D4T                  5578
#define LC4G1D4T                      5579
#define CLC4GLS1                      5580
#define CLC4GLS1_D1N                  5581
#define LC4G2D1N                      5582
#define CLC4GLS1_D1T                  5583
#define LC4G2D1T                      5584
#define LC4G2D2N                      5585
#define CLC4GLS1_D2N                  5586
#define LC4G2D2T                      5587
#define CLC4GLS1_D2T                  5588
#define CLC4GLS1_D3N                  5589
#define LC4G2D3N                      5590
#define LC4G2D3T                      5591
#define CLC4GLS1_D3T                  5592
#define CLC4GLS1_D4N                  5593
#define LC4G2D4N                      5594
#define CLC4GLS1_D4T                  5595
#define LC4G2D4T                      5596
#define CLC4GLS2                      5597
#define CLC4GLS2_D1N                  5598
#define LC4G3D1N                      5599
#define CLC4GLS2_D1T                  5600
#define LC4G3D1T                      5601
#define LC4G3D2N                      5602
#define CLC4GLS2_D2N                  5603
#define LC4G3D2T                      5604
#define CLC4GLS2_D2T                  5605
#define CLC4GLS2_D3N                  5606
#define LC4G3D3N                      5607
#define CLC4GLS2_D3T                  5608
#define LC4G3D3T                      5609
#define LC4G3D4N                      5610
#define CLC4GLS2_D4N                  5611
#define LC4G3D4T                      5612
#define CLC4GLS2_D4T                  5613
#define CLC4GLS3                      5614
#define CLC4GLS3_G4D1N                5615
#define LC4G4D1N                      5616
#define LC4G4D1T                      5617
#define CLC4GLS3_G4D1T                5618
#define LC4G4D2N                      5619
#define CLC4GLS3_G4D2N                5620
#define LC4G4D2T                      5621
#define CLC4GLS3_G4D2T                5622
#define CLC4GLS3_G4D3N                5623
#define LC4G4D3N                      5624
#define CLC4GLS3_G4D3T                5625
#define LC4G4D3T                      5626
#define LC4G4D4N                      5627
#define CLC4GLS3_G4D4N                5628
#define LC4G4D4T                      5629
#define CLC4GLS3_G4D4T                5630
#define STATUS_SHAD                   5631
#define C_SHAD                        5632
#define DC_SHAD                       5633
#define Z_SHAD                        5634
#define WREG_SHAD                     5635
#define BSR_SHAD                      5636
#define PCLATH_SHAD                   5637
#define FSR0L_SHAD                    5638
#define FSR0H_SHAD                    5639
#define FSR1L_SHAD                    5640
#define FSR1H_SHAD                    5641
#define STKPTR                        5642
#define TOSL                          5643
#define TOSH                          5644

#endif // _PIC16F1779_H_
